const ACTS = [
  {
    name: '冬意渐浓 12月新区暖心开启',
    part: [
      {
        number: '活动一', 
        title:'活动一  快速冲级拿好礼',
        time: '15-45级活动：开服起—12月4日23:59 55级活动：开服起—12月7日23:59',
        zone: '冬梦之约',
        detail:'新服开启之后，所有进入新区新注册的角色，游戏并达到指定等级，即可获得系统派发等级礼包',
        reward: [
          '（1）活动期间，等级达到15级以上的玩家，均可领取一份惊喜：30级服饰箱（锁）（1个），人物经验卷（绑）1个，每人仅可领取一次！',
          '（2）活动期间，等级达到25级以上的玩家，均可领取一份惊喜：30级服饰箱（锁）（1个），人物经验卷（绑）2个，每人仅可领取一次！',
          '（3）活动期间，等级达到35级以上的玩家，均可领取一份惊喜：10000铜币，人物经验卷（绑）5个，鉴定卷轴（绑）2个，每人仅可领取一次！',
          '（4）活动期间，等级达到45级以上的玩家，均可领取一份惊喜：30000铜币，人物经验卷（绑）8个，鉴定卷轴（绑）3个，每人仅可领取一次！',
          '（5）活动期间，等级达到55级以上的玩家，均可领取一份惊喜：300金叶，人物经验卷（绑）10个，鉴定卷轴（绑）5个，每人仅可领取一次'
        ],
        rule: '【活动规则】：在活动期间到达指定等级即可得奖。'
      },
      {
        number: '', 
        title:'活动二  首冲豪礼送不停',
        time: '2020年12月1日11：00-2020年12月3日23:59',
        zone: '冬梦之约',
        detail:'活动期内凡是登录世界OL并一次性进行50或50以上面额的充值，即可在活动结束后获得首充大礼包，礼包内容包含：100金叶+30万宠物经验箱+无名剑（绑）',
        reward: [
          '奖励将于活动结束后，由官方人员统计完毕后发放。'
        ],
        rule: ''
      },
      {
        number: '', 
        title:'活动三  属性排行榜争霸赛',
        time: '开服起-12月30日15:00',
        zone: '冬梦之约',
        detail:'活动时间内，玩家可提高指定属性，全服属性当天前10名会显示在系统当日排行榜中，活动结束后，排行榜前10名玩家可得到奖励',
        reward: [
          '各属性排行榜第1名：10000黄金+10000金叶+大额充值礼包20个',
          '各属性排行榜第2名：5000黄金+5000金叶+大额充值礼包10个',
          '各属性排行榜第3名：2500黄金+2500金叶+大额充值礼包5个',
          '各属性排行榜4~10名：大额充值礼包5个+500金叶'
        ],
        rule: '活动时间内，玩家可提高指定属性值，活动结束时进入前10名即可得奖。'
      }
    ],
    actid: '',
    status: '1'
  }
]

export default ACTS