const KINIGHT = {
  "type": "kinight",
  "show": "侠客",
  "gift": [
    {
      "name": "基础掌法",
      "auto": "0",
      "desc": [
        "效果一：肉搏伤害+151%",
        "效果二：命中+151",
        "效果三：基础力量+19%",
        "需求武器：空手"
      ]
    },
    {
      "name": "两仪八卦掌",
      "auto": "0",
      "desc": [
        "效果一：肉搏伤害+151%",
        "效果二：肉搏时攻击次数+4",
        "效果三：命中+151",
        "需求武器：空手"
      ]
    },
    {
      "name": "基础刀法",
      "auto": "0",
      "desc": [
        "效果一：刀类伤害、耐久+110%",
        "效果二：命中+60",
        "需求武器：刀类武器限制"
      ]
    },
    {
      "name": "飞天御剑流",
      "auto": "0",
      "desc": [
        "效果一：刀类伤害、耐久+65%",
        "效果二：刀时攻击次数+3",
        "效果三：致命值+70",
        "需求武器：刀类武器限制"
      ]
    },
    {
      "name": "基础剑法",
      "auto": "0",
      "desc": [
        "效果一：剑类武器伤害、耐久+65%",
        "效果二：命中+80",
        "需求武器：剑类武器限制"
      ]
    },
    {
      "name": "逍遥剑法",
      "auto": "0",
      "desc": [
        "效果一：剑类武器伤害、耐久+65%",
        "效果二：剑时攻击次数+3",
        "效果三：躲闪+50",
        "需求武器：剑类武器限制"
      ]
    },
    {
      "name": "紫电神功",
      "auto": "0",
      "desc": [
        "效果一：敏捷+70",
        "效果二：出手速度+40%",
        "效果三：基础敏捷+26%",
        "需求武器：无限制"
      ]
    },
    {
      "name": "鬼影身法",
      "auto": "0",
      "desc": [
        "效果一：基础敏捷+35%",
        "效果二：命中率+30%",
        "效果三：躲闪+50",
        "需求武器：无限制"
      ]
    },
    {
      "name": "熊象巨力功",
      "auto": "0",
      "desc": [
        "效果一：力量+75",
        "效果二：基础力量+40%",
        "需求武器：无限制"
      ]
    },
    {
      "name": "易筋经",
      "auto": "0",
      "desc": [
        "效果一：体制+75",
        "效果二：生命上限+40%",
        "效果三：生命上限+700",
        "需求武器：无限制"
      ]
    },
    {
      "name": "九霄真经",
      "auto": "0",
      "desc": [
        "效果一：智力+75",
        "效果二：法力上限+45%",
        "需求武器：无限制"
      ]
    },
    {
      "name": "般若心经",
      "auto": "0",
      "desc": [
        "效果一：感知+80",
        "效果二：状态抵抗+60%",
        "需求武器：无限制"
      ]
    },
    {
      "name": "先天罡气",
      "auto": "0",
      "desc": [
        "效果一：生命上限+890",
        "效果二：生命上限+45%",
        "效果三：伤害减免+65",
        "需求武器：无限制"
      ]
    },
    {
      "name": "先天无相神功",
      "auto": "0",
      "desc": [
        "效果一：致命值+80",
        "效果二：法力上限+700",
        "需求武器：无限制"
      ]
    },
    {
      "name": "天蚕功",
      "auto": "0",
      "desc": [
        "效果一：每回合自动恢复生命+500",
        "效果二：状态抵抗+160",
        "效果三：魔法防御力+400",
        "需求武器：无限制"
      ]
    },
    {
      "name": "九阳神功",
      "auto": "0",
      "desc": [
        "效果一：每回合自动恢复法力+500",
        "效果二：伤害减免+65",
        "效果三：生命上限+700",
        "需求武器：无限制"
      ]
    },
    {
      "name": "龙象般若功",
      "auto": "0",
      "desc": [
        "效果一：法力上限+400",
        "效果二：法力上限+50%",
        "效果三：魔法防御力+560",
        "需求武器：无限制"
      ]
    },
    {
      "name": "北冥神功",
      "auto": "0",
      "desc": [
        "效果一：法力吸收+196",
        "效果二：生命吸收+196",
        "效果三：生命上限+700",
        "需求武器：无限制"
      ]
    },
    {
      "name": "金刚不坏神功",
      "auto": "0",
      "desc": [
        "效果一：伤害减免+85",
        "效果二：反击+125",
        "效果三：生命上限+700",
        "需求武器：无限制"
      ]
    },
    {
      "name": "轩辕惊天决",
      "auto": "0",
      "desc": [
        "效果一：致命+72",
        "效果二：伤害减免+47",
        "效果三：破甲+24%",
        "需求武器：无限制"
      ]
    },
    {
      "name": "烈阳决",
      "auto": "0",
      "desc": [
        "效果一：无视伤害减免+125",
        "效果二：无视格挡+125",
        "效果三：致命+72",
        "需求武器：无限制"
      ]
    },
    {
      "name": "浩然正气",
      "auto": "0",
      "desc": [
        "效果一：生命上限+890",
        "效果二：生命上限+22%",
        "效果三：体制+65",
        "需求武器：无限制"
      ]
    },
    {
      "name": "金刚不坏体",
      "auto": "-1",
      "desc": [
        "效果一：反击+240",
        "效果二：伤害减免+240",
        "效果三：劈砍防御力+2400",
        "消耗法力值：330",
        "状态：属性增加",
        "技能类型：祝福",
        "持续回合：5",
        "范围：自身",
        "需求武器：无限制"
      ]
    },
    {
      "name": "乾坤大挪移",
      "auto": "-1",
      "desc": [
        "效果一：魔法反馈+365",
        "效果二：状态抵抗+365",
        "消耗法力值：33",
        "状态：属性增加",
        "技能类型：祝福",
        "持续回合：5",
        "需求武器：无限制"
      ]
    },
    {
      "name": "快满九字决",
      "auto": "-1",
      "desc": [
        "效果一：致命+430",
        "效果二：破甲+2800",
        "消耗法力值：210",
        "技能类型：祝福",
        "持续回合：6",
        "需求武器：无限制"
      ]
    },
    {
      "name": "伏虎绝刀势",
      "auto": "-1",
      "desc": [
        "效果一：劈砍攻击力+2200",
        "效果二：破甲+3650",
        "效果三：劈砍攻击力+22%",
        "消耗法力值：210",
        "技能类型：祝福",
        "持续回合：4",
        "需求武器：无限制"
      ]
    },
    {
      "name": "天罗地网势",
      "auto": "-1",
      "desc": [
        "效果一：命中+345",
        "效果二：强制命中率+12",
        "消耗法力值：210",
        "技能类型：祝福",
        "持续回合：4",
        "范围：自身",
        "需求武器：无限制"
      ]
    },
    {
      "name": "降龙伏虎气",
      "auto": "-1",
      "desc": [
        "效果一：法力护盾+2800",
        "效果二：魔法防御力+4500",
        "消耗法力值：264",
        "技能类型：祝福",
        "持续回合：5",
        "范围：自身",
        "需求武器：无限制"
      ]
    },
    {
      "name": "仙风云体术",
      "auto": "-1",
      "desc": [
        "效果一：出手速度+1120",
        "效果二：出手速度+63%",
        "消耗法力值：210",
        "状态：免疫定身",
        "持续回合：6",
        "范围：自身",
        "需求武器：无限制"
      ]
    },
    {
      "name": "醉仙望月步",
      "auto": "-1",
      "desc": [
        "效果一：躲闪+546",
        "效果二：躲闪+50%",
        "效果三：洞察+220",
        "消耗法力值：210",
        "状态：免疫混乱",
        "技能类型：祝福",
        "持续回合：6",
        "需求武器：无限制"
      ]
    },
    {
      "name": "隐秘步法“空蝉”",
      "auto": "-1",
      "desc": [
        "效果一：出手速度+240",
        "效果二：躲闪+215",
        "消耗法力值：319",
        "状态：幻影",
        "技能类型：祝福",
        "持续回合：4",
        "需求武器：无限制"
      ]
    },
    {
      "name": "武当八卦步",
      "auto": "-1",
      "desc": [
        "效果一：状态抵抗+280",
        "效果二：魔法防御力+2800",
        "效果三：躲闪+325",
        "消耗法力值：210",
        "技能类型：祝福",
        "持续回合：7",
        "需求武器：无限制"
      ]
    },
    {
      "name": "纯阳无极功",
      "auto": "-1",
      "desc": [
        "效果一：回复114生命",
        "效果二：回复114法力",
        "消耗法力值：891",
        "技能类型：祝福",
        "持续回合：5",
        "需求武器：无限制"
      ]
    },
    {
      "name": "三寸真元劲",
      "auto": "-1",
      "desc": [
        "效果一：穿刺攻击力+2200",
        "效果二：破甲+3650",
        "效果三：穿刺攻击力+22%",
        "消耗法力值：210",
        "状态：免疫封技",
        "技能类型：祝福",
        "持续回合：4",
        "需求武器：无限制"
      ]
    },
    {
      "name": "九阳碎骨劲",
      "auto": "-1",
      "desc": [
        "效果一：破甲+4500",
        "效果二：劈砍攻击力+2200",
        "效果三：破甲+22%",
        "消耗法力值：264",
        "技能类型：祝福",
        "持续回合：4",
        "需求武器：无限制"
      ]
    },
    {
      "name": "九阳真气",
      "auto": "-1",
      "desc": [
        "效果一：回复最大生命值12%生命",
        "效果二：回复最大法力值+14%法力",
        "消耗法力值：638",
        "技能类型：祝福",
        "持续回合：3",
        "范围：自身",
        "需求武器：无限制"
      ]
    },
    {
      "name": "压制攻击",
      "auto": "-1",
      "desc": [
        "效果一：攻击次数-6",
        "效果二：命中-260",
        "效果二：魔法命中-260",
        "消耗法力值：220",
        "技能类型：远程穿刺攻击",
        "攻击次数：3",
        "持续回合：6",
        "范围：敌当前生命最大者",
        "需求武器：轻刀、轻剑"
      ]
    },
    {
      "name": "万毒心经",
      "auto": "-1",
      "desc": [
        "效果一：造成-660伤害",
        "效果二：附带米国闹钟功能+240",
        "效果三：技能附带回复+583生命",
        "消耗法力值：440",
        "状态：中毒",
        "技能类型：诅咒",
        "持续回合：4",
        "范围：敌全体",
        "需求武器：空手"
      ]
    },
    {
      "name": "天霜拳",
      "auto": "-1",
      "desc": [
        "效果一：技能附带无视目标500反击",
        "效果二：躲闪-430",
        "消耗法力值：600",
        "状态：定身",
        "技能类型：近身劈砍攻击",
        "攻击次数：+1",
        "持续回合：4",
        "范围：敌当前生命最大者",
        "需求武器：空手"
      ]
    },
    {
      "name": "乾坤剑决",
      "auto": "-1",
      "desc": [
        "效果一：剑时攻击次数+7",
        "效果二：躲闪+22%",
        "效果三：破甲+22%",
        "消耗法力值：400",
        "状态：属性减少",
        "技能类型：祝福",
        "持续回合：5",
        "需求武器：剑类武器限制"
      ]
    },
    {
      "name": "寒冰绵掌",
      "auto": "1",
      "desc": [
        "效果一：命中-546",
        "效果二：躲闪-546",
        "效果三：魔法命中-546",
        "消耗法力值：220",
        "状态：定身",
        "技能类型：近身劈砍攻击",
        "持续回合：7",
        "范围：敌单体",
        "需求武器：空手"
      ]
    },
    {
      "name": "赤练神掌",
      "auto": "1",
      "desc": [
        "效果一：造成最大生命值-12%的伤害",
        "效果二：燃烧最大法力值-12%的法力",
        "效果三：附带无视目标553反击",
        "消耗法力值：55",
        "技能类型：近身劈砍攻击",
        "持续回合：5",
        "范围：敌单体",
        "需求武器：空手"
      ]
    },
    {
      "name": "降龙十八掌",
      "auto": "1",
      "desc": [
        "效果一：附带命中+500",
        "效果二：技能附带无视目标705反击",
        "效果三：技能附带无视目标500格挡",
        "消耗法力值：300",
        "技能类型：近身劈砍攻击",
        "范围：敌六人长方",
        "需求武器：空手"
      ]
    },
    {
      "name": "飘雪穿云拳",
      "auto": "1",
      "desc": [
        "效果一：劈砍防御力-6600",
        "效果二：穿刺防御力-6600",
        "效果三：无视目标5300点无力防御",
        "消耗法力值：100",
        "技能类型：近身穿刺攻击",
        "攻击次数：4",
        "持续回合：8",
        "范围：敌单体",
        "需求武器：空手"
      ]
    },
    {
      "name": "落英神剑掌",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标660反击",
        "效果二：技能附带无视目标660伤害减免",
        "效果二：附带命中+280",
        "消耗法力值：110",
        "技能类型：近身穿刺攻击",
        "攻击次数：7",
        "范围：敌前后两人",
        "需求武器：空手"
      ]
    },
    {
      "name": "火云掌",
      "auto": "1",
      "desc": [
        "效果一：造成-1470伤害",
        "效果二：附带致命点+280",
        "效果三：附带命中+280",
        "消耗法力值：220",
        "技能类型：近身劈砍攻击",
        "攻击次数：1",
        "持续回合：1",
        "范围：敌正方",
        "需求武器：空手"
      ]
    },
    {
      "name": "摧心掌",
      "auto": "1",
      "desc": [
        "效果一：造成-910伤害回复",
        "效果二：附带命中+280",
        "效果三：无视目标5300点物理防御",
        "消耗法力值：55",
        "技能类型：近身劈砍攻击",
        "持续回合：9",
        "范围：敌十字",
        "需求武器：空手"
      ]
    },
    {
      "name": "惊神指",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标660反击",
        "效果二：出手速度-980",
        "效果三：无视目标5300点物理防御",
        "消耗法力值：534",
        "状态：封魔",
        "技能类型：近身穿刺攻击",
        "攻击次数：4",
        "持续回合：3",
        "范围：敌单体",
        "需求武器：单手持武器或空手"
      ]
    },
    {
      "name": "金刚指",
      "auto": "1",
      "desc": [
        "效果一：附带伤害+4500",
        "效果二：技能附带无视目标660伤害减免",
        "效果三：无视目标4700点物理防御",
        "消耗法力值：220",
        "技能类型：近身穿刺攻击",
        "范围：敌前后两人",
        "需求武器：单手持武器或空手"
      ]
    },
    {
      "name": "九阳神剑",
      "auto": "1",
      "desc": [
        "效果一：附带伤害+2190",
        "效果二：无视目标2800点物理防御",
        "效果三：伤害减免-280",
        "消耗法力值：534",
        "状态：禁言",
        "技能类型：近身劈砍攻击",
        "持续回合：4",
        "范围：敌正方",
        "需求武器：单手持武器或空手"
      ]
    },
    {
      "name": "六脉神剑",
      "auto": "1",
      "desc": [
        "效果一：附带伤害+2190",
        "效果二：出手速度-980",
        "效果三：攻击次数-7",
        "消耗法力值：534",
        "状态：封技",
        "技能类型：近身穿刺攻击",
        "持续回合：4",
        "范围：敌单体",
        "需求武器：单手持武器或空手"
      ]
    },
    {
      "name": "一阳指",
      "auto": "1",
      "desc": [
        "效果一：附带命中+359",
        "效果二：附带伤害+4500",
        "效果三：无视目标4500点物理防御",
        "消耗法力值：220",
        "技能类型：近身穿刺攻击",
        "范围：敌前后两人",
        "需求武器：单手持武器或空手"
      ]
    },
    {
      "name": "北冥神功",
      "auto": "1",
      "desc": [
        "效果一：燃烧目标-1260的法力",
        "效果二：附带命中+240",
        "效果三：技能附带回复+583法力",
        "消耗生命值：485",
        "技能类型：诅咒",
        "持续回合：5",
        "范围：敌单体",
        "需求武器：无限制"
      ]
    },
    {
      "name": "吸星大法",
      "auto": "1",
      "desc": [
        "效果一：造成-1260伤害",
        "效果二：附带命中+240",
        "效果三：技能附带回复+583生命",
        "消耗法力值：220",
        "技能类型：诅咒",
        "持续回合：5",
        "范围：敌单体",
        "需求武器：无限制"
      ]
    },
    {
      "name": "化工大法",
      "auto": "1",
      "desc": [
        "效果一：燃烧最大法力值-29%的法力",
        "效果二：附带命中+240",
        "效果三：燃烧目标-1260的法力",
        "消耗法力值：534",
        "技能类型：诅咒",
        "持续回合：3",
        "范围：敌单体",
        "需求武器：无限制"
      ]
    },
    {
      "name": "挽留神剑",
      "auto": "1",
      "desc": [
        "效果一：躲闪-372",
        "效果二：附带无视目标415伤害减免",
        "效果三：技能附带无视目标240反击",
        "消耗法力值：220",
        "状态：定身",
        "技能类型：近身穿刺攻击",
        "持续回合：4",
        "范围：敌单体",
        "需求武器：单手剑"
      ]
    },
    {
      "name": "御剑术",
      "auto": "1",
      "desc": [
        "效果一：无视目标2890点物理防御",
        "效果二：附带命中+65",
        "效果三：技能附带无视目标240反击",
        "消耗法力值：220",
        "技能类型：近身穿刺攻击",
        "范围：敌前后两人",
        "需求武器：剑类武器限制"
      ]
    },
    {
      "name": "长空十字剑",
      "auto": "1",
      "desc": [
        "效果一：附带伤害=3060",
        "效果二：附带命中+48",
        "效果三：附带无视目标240伤害减免",
        "消耗法力值：534",
        "技能类型：远程穿刺攻击",
        "攻击次数：3",
        "范围：敌十字",
        "需求武器：单手剑双持"
      ]
    },
    {
      "name": "疯狂快剑",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标360反击",
        "效果二：技能附带无视目标360伤害减免",
        "效果三：技能附带无视目标360格挡",
        "消耗法力值：220",
        "技能类型：远程穿刺攻击",
        "攻击次数：6",
        "范围：敌单体",
        "需求武器：轻剑、轻刀"
      ]
    },
    {
      "name": "破体无形剑气",
      "auto": "1",
      "desc": [
        "效果一：无视目标2270点物理防御",
        "效果二：技能附带无视目标360反击",
        "效果三：技能附带无视目标240格挡",
        "消耗法力值：220",
        "技能类型：近身穿刺攻击",
        "范围：敌前后两人",
        "需求武器：重剑限制"
      ]
    },
    {
      "name": "万剑诀",
      "auto": "1",
      "desc": [
        "效果一：附加强制命中率+24",
        "效果二：技能附带无视目标240反击",
        "消耗法力值：534",
        "技能类型：近身穿刺攻击",
        "范围：敌六人长方",
        "需求武器：剑类武器限制"
      ]
    },
    {
      "name": "回天剑舞七连",
      "auto": "1",
      "desc": [
        "效果一：附带伤害+3060",
        "效果二：技能附带无视目标360伤害减免",
        "效果三：无视目标3000点物理防御",
        "消耗法力值：220",
        "技能类型：近身劈砍攻击",
        "攻击次数：7",
        "范围：敌十字",
        "需求武器：单手刀双持限制"
      ]
    },
    {
      "name": "天翔龙闪",
      "auto": "1",
      "desc": [
        "效果一：附带致命+240",
        "效果二：附加强制命中率+36",
        "消耗法力值：534",
        "技能类型：近身劈砍攻击",
        "范围：敌六人长方",
        "需求武器：刀类武器限制"
      ]
    },
    {
      "name": "付魔金刚刀",
      "auto": "1",
      "desc": [
        "效果一：无视目标4500点物理防御",
        "效果二：附带致命点+199",
        "效果三：技能附带无视目标430反击",
        "消耗法力值：220",
        "技能类型：近身劈砍攻击",
        "攻击次数：3",
        "范围：敌单体",
        "需求武器：重刀限制"
      ]
    },
    {
      "name": "天魔邪刀追魂五式",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标385反击",
        "效果二：燃烧目标-600的法力",
        "效果三：燃烧目标最大法力值-13%的法力",
        "消耗法力值：220",
        "状态：封魔",
        "技能类型：近身劈砍攻击",
        "攻击次数：+7",
        "持续回合：5",
        "范围：敌单体",
        "需求武器：刀类武器限制"
      ]
    },
    {
      "name": "血光刀气",
      "auto": "1",
      "desc": [
        "效果一：技能附带30%生命吸收",
        "效果二：造成-780伤害",
        "效果三：技能附带无视目标360伤害减免",
        "消耗法力值：220",
        "技能类型：近身劈砍攻击",
        "攻击次数：+2",
        "持续回合：6",
        "范围：敌十字",
        "需求武器：单手刀限制"
      ]
    },
    {
      "name": "绝情绝刀",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标240反击",
        "效果二：无视目标3000点物理防御",
        "效果三：技能附带无视目标240伤害减免",
        "消耗法力值：220",
        "技能类型：近身劈砍攻击",
        "攻击次数：3",
        "范围：敌六人长方",
        "需求武器：刀类武器限制"
      ]
    },
    {
      "name": "月华乱神剑",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标240格挡",
        "效果二：燃烧最大法力值-12%的法力",
        "效果三：燃烧目标-480的法力",
        "消耗法力值：220",
        "状态：禁言",
        "技能类型：近身穿刺攻击",
        "攻击次数：1",
        "范围：敌前后两人",
        "需求武器：剑类武器限制"
      ]
    },
    {
      "name": "月冷星寒剑",
      "auto": "1",
      "desc": [
        "效果一：命中率-24%",
        "效果二：技能附带无视目标240格挡",
        "效果三：攻击次数-6",
        "消耗法力值：220",
        "状态：衰弱",
        "技能类型：近身穿刺攻击",
        "攻击次数：+2",
        "持续回合：6",
        "范围：敌前后两人",
        "需求武器：单手剑双持限制"
      ]
    },
    {
      "name": "毒龙狂乱剑",
      "auto": "1",
      "desc": [
        "效果一：造成-1260伤害回复",
        "效果二：技能附带+9.6%生命吸收",
        "效果三：技能附带无视目标240伤害减免",
        "消耗法力值：330",
        "状态：中毒",
        "技能类型：近身穿刺攻击",
        "攻击次数：+4",
        "范围：敌前后两人",
        "需求武器：单手剑双持限制"
      ]
    },
    {
      "name": "灵犀一指",
      "auto": "1",
      "desc": [
        "效果一：攻击次数-8",
        "效果二：附带魔法命中+210",
        "效果三：强制命中率-26",
        "消耗法力值：350",
        "状态：衰弱",
        "技能类型：诅咒",
        "攻击次数：+5",
        "范围：敌前后两人",
        "需求武器：空手"
      ]
    }
  ]
}

export default KINIGHT