const SAGE = {
  "type": "sage",
  "show": "贤者",
  "gift": [
    {
      "name": "神秘咒文",
      "auto": "0",
      "desc": [
        "效果一：智力+75",
        "效果二：感知+76",
        "效果三：法力上限+750",
        "需求武器：无限制"
      ]
    },
    {
      "name": "书本使用",
      "auto": "0",
      "desc": [
        "效果一：无视目标魔法反馈+133",
        "效果二：无视目标状态抵抗+133",
        "效果三：无视目标洞察+133",
        "需求武器：无限制"
      ]
    },
    {
      "name": "神学",
      "auto": "0",
      "desc": [
        "效果一：感知+76",
        "效果二：法力上限+740",
        "效果三：基础感知+22%",
        "需求武器：无限制"
      ]
    },
    {
      "name": "冥思",
      "auto": "0",
      "desc": [
        "效果一：每回合自动恢复法力+600",
        "效果二：法力上限+740",
        "效果三：法力吸收+133",
        "需求武器：无限制"
      ]
    },
    {
      "name": "自由咏唱",
      "auto": "0",
      "desc": [
        "效果一：出手+740",
        "效果二：无视目标魔法反馈150",
        "效果三：法力上限+740",
        "需求武器：无限制"
      ]
    },
    {
      "name": "思维敏捷",
      "auto": "0",
      "desc": [
        "效果一：出手速度+740",
        "效果二：出手速度+28%",
        "效果三：每回合自动恢复法力+363",
        "需求武器：无限制"
      ]
    },
    {
      "name": "权杖使用",
      "auto": "0",
      "desc": [
        "效果一：法杖时攻击次数+4",
        "效果二：魔法攻击力+430",
        "效果三：法力上限+740",
        "需求武器：无限制"
      ]
    },
    {
      "name": "法器使用",
      "auto": "0",
      "desc": [
        "效果一：法球武器伤害、耐久+150%",
        "效果二：魔法攻击力+430",
        "效果三：法力上限+740",
        "需求武器：无限制"
      ]
    },
    {
      "name": "神奇专精",
      "auto": "0",
      "desc": [
        "效果一：魔法命中+85",
        "效果二：法球时攻击次数+4",
        "效果三：法球武器伤害、耐久+150%",
        "需求武器：无限制"
      ]
    },
    {
      "name": "心之护盾",
      "auto": "0",
      "desc": [
        "效果一：状态抵抗+76",
        "效果二：伤害减免+73",
        "效果三：感知+76",
        "需求武器：无限制"
      ]
    },
    {
      "name": "圣灵体魄",
      "auto": "0",
      "desc": [
        "效果一：生命上限+810",
        "效果二：体质+73",
        "效果三：伤害减免+70",
        "需求武器：无限制"
      ]
    },
    {
      "name": "圣灵力魄",
      "auto": "0",
      "desc": [
        "效果一：生命上限+810",
        "效果二：力量+73",
        "效果三：致命值+70",
        "需求武器：无限制"
      ]
    },
    {
      "name": "元素精通",
      "auto": "0",
      "desc": [
        "效果一：魔法命中+82",
        "效果二：魔法攻击力+26%",
        "效果三：魔法穿透+740",
        "需求武器：无限制"
      ]
    },
    {
      "name": "精神爆破",
      "auto": "0",
      "desc": [
        "效果一：法力上限+740",
        "效果二：无视目标状态抵抗133",
        "效果三：魔法穿透+740",
        "需求武器：无限制"
      ]
    },
    {
      "name": "魔法增效",
      "auto": "0",
      "desc": [
        "效果一：法力上限+740",
        "效果二：无视目标洞察133",
        "效果三：魔法穿透+740",
        "需求武器：无限制"
      ]
    },
    {
      "name": "魔力护盾",
      "auto": "0",
      "desc": [
        "效果一：法力护盾+740",
        "效果二：法力护盾+28%",
        "效果三：法力上限+740",
        "需求武器：无限制"
      ]
    },
    {
      "name": "风之迅捷",
      "auto": "0",
      "desc": [
        "效果一：出手速度+363",
        "效果二：敏捷+73",
        "效果三：躲闪+45",
        "需求武器：无限制"
      ]
    },
    {
      "name": "符文加身",
      "auto": "0",
      "desc": [
        "效果一：洞察+180",
        "效果二：致命+125",
        "效果三：魔法命中+84",
        "需求武器：无限制"
      ]
    },
    {
      "name": "圣贤附体",
      "auto": "0",
      "desc": [
        "效果一：状态抵抗值+135",
        "效果二：伤害减免+250",
        "效果三：免伤护盾+2",
        "需求武器：无限制"
      ]
    },
    {
      "name": "魔力仆从",
      "auto": "0",
      "desc": [
        "效果一：宠物智力+70%",
        "效果二：宠物感知+70%",
        "效果三：宠物法力上限+70%",
        "需求武器：无限制"
      ]
    },
    {
      "name": "法器强化",
      "auto": "0",
      "desc": [
        "效果一：法器武器伤害、耐久+150%",
        "效果二：感知+55",
        "效果三：无视魔法反馈+220",
        "需求武器：无限制"
      ]
    },
    {
      "name": "神器重铸",
      "auto": "0",
      "desc": [
        "效果一：法器武器伤害、耐久+110%",
        "效果二：无视洞察+150",
        "效果三：致命点+120",
        "需求武器：无限制"
      ]
    },
    {
      "name": "风语祝福",
      "auto": "0",
      "desc": [
        "效果一：出手速度+900",
        "效果二：用法器时攻击次数+4",
        "效果三：无视魔法反馈+180",
        "需求武器：无限制"
      ]
    },
    {
      "name": "不死意志",
      "auto": "-1",
      "desc": [
        "效果一：每回合自动回复生命+363",
        "效果二：状态抵抗+133",
        "消耗法力值：1000",
        "状态：不死意志",
        "技能类型：祝福",
        "持续回合：4",
        "范围：我当前生命最大者",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "死者苏生",
      "auto": "-1",
      "desc": [
        "效果一：每回合自动回复生命+363",
        "效果二：状态抵抗+133",
        "消耗法力值：1000",
        "状态：死者苏生",
        "技能类型：祝福",
        "持续回合：4",
        "范围：我当前生命最大者",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "死亡傀儡",
      "auto": "-1",
      "desc": [
        "效果一：每回合自动回复生命+363",
        "效果二：状态抵抗+133",
        "消耗法力值：1000",
        "状态：死亡傀儡",
        "技能类型：祝福",
        "持续回合：4",
        "范围：我当前生命最大者",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "沉静力场",
      "auto": "-1",
      "desc": [
        "效果一：技能附带无视目标26%状态抵抗",
        "效果二：状态抵抗-210",
        "效果三：技能附带无视目标260洞察",
        "消耗法力值：1000",
        "状态：禁言",
        "技能类型：诅咒",
        "持续回合：4",
        "范围：敌正方",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "精神鞭笞",
      "auto": "-1",
      "desc": [
        "效果一：技能附带无视目标26%状态抵抗",
        "效果二：状态抵抗-210",
        "效果三：技能附带无视目标260洞察",
        "消耗法力值：1100",
        "状态：封技",
        "技能类型：诅咒",
        "持续回合：4",
        "范围：敌正方",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "圣灵加护",
      "auto": "-1",
      "desc": [
        "效果一：状态抵抗+260",
        "效果二：每回合自动恢复法力+260",
        "效果三：每回合自动恢复生命+260",
        "消耗法力值：500",
        "状态：全建议免疫",
        "技能类型：祝福",
        "持续回合：6",
        "范围：敌正方",
        "需求武器：无限制"
      ]
    },
    {
      "name": "治疗力场",
      "auto": "-1",
      "desc": [
        "效果一：回复+1300生命",
        "效果二：回复最大生命值6%生命",
        "消耗法力值：1000",
        "技能类型：祝福",
        "持续回合：6",
        "需求武器：无限制"
      ]
    },
    {
      "name": "魔力诅咒",
      "auto": "-1",
      "desc": [
        "效果一：每回合自动恢复法力-450",
        "效果二：魔法命中-178",
        "效果三：燃烧最大法力值-6%的法力",
        "消耗法力值：1000",
        "技能类型：诅咒",
        "持续回合：4",
        "范围：敌六人长方",
        "需求武器：无限制"
      ]
    },
    {
      "name": "生命陷落",
      "auto": "-1",
      "desc": [
        "效果一：造成-1300伤害",
        "效果二：造成最大生命值-6%的伤害",
        "消耗法力值：1000",
        "技能类型：诅咒",
        "持续回合：5",
        "范围：敌六人长方",
        "需求武器：无限制"
      ]
    },
    {
      "name": "法术火海",
      "auto": "-1",
      "desc": [
        "效果一：造成最大生命值15%的伤害",
        "效果二：魔法命中-280",
        "效果三：目标洞察值-280",
        "消耗法力值：3000",
        "攻击次数：+3",
        "状态：禁言",
        "技能类型：魔法攻击",
        "持续回合：3",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "法术霜冻",
      "auto": "-1",
      "desc": [
        "效果一：造成最大生命值9%的伤害",
        "效果二：伤害减免-240， 定身",
        "效果三：目标洞察值-320",
        "消耗法力值：3500",
        "攻击次数：+4",
        "技能类型：魔法攻击",
        "持续回合：3",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "秘术-不死意志",
      "auto": "1",
      "desc": [
        "效果一：每回合自动恢复生命+363",
        "效果二：状态抵抗+133",
        "消耗法力值：2000",
        "状态：不死意志",
        "技能类型：祝福",
        "持续回合：4",
        "范围：敌我十字",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "秘术-死者苏生",
      "auto": "1",
      "desc": [
        "效果一：每回合自动恢复生命+363",
        "效果二：状态抵抗+133",
        "消耗法力值：2000",
        "状态：死者苏生",
        "技能类型：祝福",
        "持续回合：4",
        "范围：敌我十字",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "秘术-死亡傀儡",
      "auto": "1",
      "desc": [
        "效果一：每回合自动恢复生命+363",
        "效果二：状态抵抗+133",
        "消耗法力值：2000",
        "状态：死亡傀儡",
        "技能类型：祝福",
        "持续回合：4",
        "范围：敌我十字",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "强愈术",
      "auto": "1",
      "desc": [
        "效果一：回复4100生命",
        "效果二：回复最大生命值12%生命",
        "消耗法力值：3500",
        "技能类型：祝福",
        "持续回合：5",
        "范围：我十字",
        "需求武器：无限制"
      ]
    },
    {
      "name": "祝福",
      "auto": "1",
      "desc": [
        "效果一：攻击次数+3",
        "效果二：劈砍攻击力+23%",
        "效果三：穿刺攻击力+23%",
        "消耗法力值：500",
        "状态：属性增加 属性增加",
        "技能类型：祝福",
        "持续回合：4",
        "范围：我十字",
        "需求武器：无限制"
      ]
    },
    {
      "name": "急救",
      "auto": "1",
      "desc": [
        "效果一：回复8700生命",
        "效果二：回复最大生命值7%生命",
        "效果三：清除目标减益状态",
        "消耗法力值：4000",
        "技能类型：祝福",
        "持续回合：2",
        "范围：我十字",
        "需求武器：无限制"
      ]
    },
    {
      "name": "魔力纹路破坏",
      "auto": "1",
      "desc": [
        "效果一：清除目标魔法攻击无效状态",
        "效果二：法力护盾-57%",
        "效果三：每回合自动回复法力-410",
        "消耗法力值：2000",
        "状态：禁言",
        "技能类型：祝福",
        "持续回合：3",
        "范围：敌正方",
        "需求武器：无限制"
      ]
    },
    {
      "name": "眩光术",
      "auto": "1",
      "desc": [
        "效果一：状态抵抗-210",
        "效果二：洞察-210",
        "效果三：命中-210",
        "消耗法力值：500",
        "技能类型：诅咒",
        "持续回合：4",
        "范围：敌正方",
        "需求武器：无限制"
      ]
    },
    {
      "name": "雷电冲击",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标28%状态抵抗",
        "效果二：状态抵抗-310",
        "消耗法力值：2000",
        "状态：混乱",
        "技能类型：魔法",
        "持续回合：3",
        "范围：敌十字",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "炙炎爆裂",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标28%状态抵抗",
        "效果二：造成-520伤害",
        "效果三：造成最大生命值-4%伤害",
        "消耗法力值：2000",
        "状态：火烧",
        "技能类型：魔法",
        "持续回合：5",
        "范围：敌十字",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "寒冰风暴",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标28%状态抵抗",
        "效果二：出手速度-520",
        "消耗法力值：2000",
        "状态：定身",
        "技能类型：魔法",
        "持续回合：5",
        "范围：敌十字",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "神圣惩戒",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标28%状态抵抗",
        "效果二：状态抵抗-138",
        "消耗法力值：2000",
        "状态：封魔",
        "技能类型：魔法",
        "持续回合：3",
        "范围：敌十字",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "法力冲击",
      "auto": "1",
      "desc": [
        "效果一：技能附带无视目标490魔法反馈",
        "效果二：附带命中+356",
        "效果三：技能附带无视目标490洞察",
        "消耗法力值：350",
        "技能类型：魔法",
        "攻击次数：6",
        "范围：敌十字",
        "需求武器：法球限制"
      ]
    },
    {
      "name": "法书蜜语",
      "auto": "1",
      "desc": [
        "效果一：造成最大生命值9%的伤害，封技",
        "效果二：目标伤害减免值-360",
        "效果三：免伤护盾-2",
        "消耗法力值：3500",
        "攻击次数：+4",
        "技能类型：魔法攻击",
        "持续回合：3",
        "范围：敌六人长方",
        "需求武器：法球限制"
      ]
    }
  ]
}

export default SAGE